Repository: xccui/SPWAF-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Flink provides different ways to deal with late records, which are discussed in “Handling Late Data” on page 148.
zh_cn: 为了处理迟到记录，Flink提供了不同的机制，我们将在148页"处理迟到数据"一节讨论它们。

source: Flink 1.7 exposes the first version (v1) of the API.
zh_cn: Flink 1.7中公开的是第一版本（v1）的API。

source: Flink DataStream applications process streams of events that are represented as data objects.
zh_cn: Flink DataStream应用所处理的事件会表示为数据对象。

source: Flink Docker image but started with a different argument (args: -taskmanager).
zh_cn: 只是启动参数不一样（args: -taskmanager）。

source: Flink Docker images are not part of the official Apache Flink release.
zh_cn: 因此你也可以使用非官方发布版的Apache Flink Docker镜像来提交应用。

source: Flink SQL follows the ANSI SQL standard and leverages Apache Calcite for query parsing and optimization.
zh_cn: Flink SQL遵循ANSI SQL标准，并使用Apache Calcite来完成查询解析和优化。

source: Flink accepts a class as a POJO if it satisfies the following conditions:
zh_cn: 如果一个类满足如下条件，Flink就会将它看做POJO：

source: Flink achieves millisecond latencies and is able to process millions of events per second.
zh_cn: Flink能够实现毫秒级延迟，同时每秒可处理数百万条事件。

source: Flink allows for updating the application code of jobs and migrating jobs to dif‐ ferent Flink clusters without losing the state of the application.
zh_cn: Flink允许在不丢失应用状态的前提下更新作业的程序代码或进行跨Flink集群的作业迁移。

source: Flink also aims to keep its own external dependencies to a minimum and hides most of them (including tran‐ sitive dependencies) from user applications to prevent version conflicts.
zh_cn: 为了尽可能降低自身的外部依赖，Flink将很多依赖（包括传递依赖）都隐藏起来，对用户应用不可见，以此来避免版本冲突。

source: Flink also features a type extraction system that analyzes the input and return types of functions to automatically obtain type information and hence serializers and deserial‐ izers.
zh_cn: 此外，Flink中还有一个类型提取系统，它可以通过分析函数的输入、输出类型来自动获取类型信息，继而得到相应的序列化器和反序列化器。

source: Flink also features version-specific connectors for the Kafka ver‐ sions 0.8, 0.9, 0.10, and 0.11.
zh_cn: 同时它还为Kafka 0.8、0.9、0.10以及0.11版本分别提供了专用的连接器。

source: Flink also features version-specific con‐ nectors for Kafka versions 0.8, 0.9, 0.10, and 0.11.
zh_cn: 同时它还为Kafka 0.8、0.9、0.10以及0.11版本分别提供了专用的连接器。

source: Flink analyzes each type that does not fall into any category and checks to see if it can be identified and handled as a POJO type.
zh_cn: Flink会分析那些不属于任何一类的数据类型，并尝试将它们作为POJO类型进行处理。

source: Flink applications are executed in parallel by parallelizing operators into tasks and distributing these tasks across the worker processes in a cluster.
zh_cn: 为了实现并行执行，Flink应用会将算子划分为不同的任务，并将这些任务分配到集群中的不同工作进程上。

source: Flink applications are executed in parallel in a distributed environment such as a cluster of machines.
zh_cn: Flink应用可以在分布式环境中（例如机器集群）并行执行。

source: Flink applications can be deployed in two different styles.
zh_cn: Flink应用可以通过两种模式进行部署。

source: Flink applications can be scaled to run on thousands of cores.
zh_cn: 基于Flink的应用可以扩展到数千核心之上。

source: Flink appli‐ cations can be scaled to run on thousands of cores.
zh_cn: 基于Flink的应用可以扩展到数千核心之上。

source: Flink can be deployed in different environments, such as a local machine, a bare- metal cluster, a Hadoop YARN cluster, or a Kubernetes cluster.
zh_cn: Flink支持多种环境下的部署，例如本地机器、裸机集群、Hadoop YARN集群或Kubernetes集群。

source: Flink can run on YARN in two modes: the job mode and the session mode.
zh_cn: Flink能够以两种模式和YARN进行集成：作业模式和会话模式。

source: Flink collects several system and application metrics by default.
zh_cn: Flink在默认情况下会收集很多系统及应用指标。

source: Flink configures the interval to the same value as the akka.ask.timeout parameter
zh_cn: Flink将这个间隔配置得和./conf/flink-conf.yaml中akka.ask.timeout参数的值（默认10秒）相同。

source: Flink creates a separate (embedded) RocksDB instance for each task of a keyed operator.
zh_cn: Flink会为每个键值分区算子的任务创建一个单独的（嵌入式）RocksDB实例。

source: Flink does not actively limit the amount of CPU resources it consumes.
zh_cn: Flink不会主动限制自身消耗的CPU资源量，

source: Flink does not automatically take a save‐ point, so a user (or external scheduler) has to explicitly trigger its creation.
zh_cn: 保存点的生成不是由Flink自动完成，而是需要由用户（或外部调度器）显式触发。

source: Flink does not delay explicitly triggered savepoints due to checkpointing opera‐ tions.
zh_cn: Flink不会因为生成检查点而推迟显式触发的保存点。

source: Flink does not guarantee or grant heap memory per task or slot.
zh_cn: Flink无法实现按任务或处理槽分配堆内存。

source: Flink does not implement all this functionality by itself.
zh_cn: Flink并没有依靠自己实现所有上述功能，

source: Flink does not provide durable, distributed storage.
zh_cn: Flink没有提供分布式持久化存储，

source: Flink does not provide tooling to restart failed processes when running in a stand-alone cluster.
zh_cn: Flink没有针对独立集群模式提供重启故障进程的工具，

source: Flink does not provide tooling to restart failed processes when running in a standalone cluster.
zh_cn: Flink没有针对独立集群模式提供重启故障进程的工具，

source: Flink encodes timestamps as 16-byte Long values and attaches them as metadata to records.
zh_cn: Flink内部采用16字节的Long值对时间戳进行编码，并将它们以元数据（metadata）的形式附加在记录上。

source: Flink encodes timestamps as 16-byte long values and attaches them as metadata to records.
zh_cn: Flink内部将时间戳编码为16字节的long类型值并将它们以元数据的形式附加在记录之上。

source: Flink exposes all interfaces for user-defined functions, such as MapFunction, Filter Function, and ProcessFunction, as interfaces or abstract classes.
zh_cn: Flink中所有用户自定义函数（如MapFunction、FilterFunction及ProcessFunction）的接口都是以接口或抽象类的形式对外暴露，

source: Flink features Kerberos integration with Hadoop and its components (YARN, HDFS, HBase), ZooKeeper, and Kafka.
zh_cn: 它还支持Kerberos与Hadoop及相关组件（YARN、HDFS、HBase）、ZooKeeper以及Kafka的集成，

source: Flink features an optimization technique called task chaining that reduces the over‐ head of local communication under certain conditions.
zh_cn: Flink采用一种名为任务链接的优化技术来降低某些情况下的本地通信开销。

source: Flink features an optimization technique called task chaining which reduces the over‐ head of local communication under certain conditions.
zh_cn: Flink利用一项名为任务链接（task chaining）的优化技术来降低部分情况下本地通信的开销。

source: Flink features dedicated operators for time-based stream joins, which are discussed in Chapter 6.
zh_cn: Flink对基于时间的流式Join设有专用算子，相关内容会在第6章讨论。

source: Flink features different techniques to reduce the communication costs between tasks.
zh_cn: Flink采用多种技术来降低任务之间的通信开销。

source: Flink features layered APIs with varying tradeoffs for expressiveness and ease-of-use.
zh_cn: Flink提供的层次化API，在表达能力和易用性方面各有权衡。

source: Flink features multiple ResourceManagers for different environments and resource providers such as YARN, Mesos, Kubernetes, and stand-alone deploy‐ ments.
zh_cn: 针对不同的环境和资源提供者（例如：YARN、Mesos、Kubernetes或独立部署），Flink提供了不同的ResourceManager。

source: Flink features multiple ResourceManagers for different environments and resource providers such as YARN, Mesos, Kubernetes, and standalone deploy‐ ments.
zh_cn: 针对不同的环境和资源提供者（resource provider）（如YARN、Mesos、Kubernetes或独立部署），Flink提供了不同的ResourceManager。

source: Flink features savepoints to maintain applications and their states.
zh_cn: Flink利用保存点机制来对应用及其状态进行维护，

source: Flink features three restart strategies to address this problem:
zh_cn: 为应对该问题，Flink提供了三种重启策略：

source: Flink follows a simple and low-overhead approach to provide useful latency metric measurements.
zh_cn: 为了提供一个实用的延迟指标测量手段，Flink选取了一个非常简单且开销低的方法。

source: Flink for a while without ever needing to worry about TypeInformation for your data
zh_cn: 因此你可以先用上一段时间Flink而无需担心数据类型的TypeInformation问题。

source: Flink gathers a set of predefined metrics during runtime and also provides a frame‐ work that allows you to define and track your own metrics.
zh_cn: Flink在运行时会收集一些预定义的指标，此外还供了一个框架供你定义和追踪自定义指标。

source: Flink guarantees this by periodically writing a consistent checkpoint of the application state to a remote and durable storage.
zh_cn: 为了实现该特性，Flink会定期将应用状态的一致性检查点（checkpoint）写入远程持久化存储。

source: Flink has built-in support for local filesystems, including locally mounted net‐ work filesystems, such as NFS or SAN, and does not require additional configu‐ ration.
zh_cn: Flink内部支持本地文件系统，其中还包括本地挂载的网络文件系统（例如NFS或SAN），你无须对它们进行额外配置。

source: Flink implements a credit-based flow control mechanism that works as follows.
zh_cn: Flink实现了一个基于信用值的流量控制机制，它的工作原理如下。

source: Flink implements a credit-based flow control mechanism which works as follows.
zh_cn: Flink实现了一个基于信用度的流量控制机制，它的工作原理如下。

source: Flink implements tweaks that can alleviate the performance impact under certain conditions.
zh_cn: Flink实现了一些调整策略，从而可以减轻某些条件下对性能的影响。

source: Flink implements watermarks as special records that are received and emitted by operator tasks.
zh_cn: Flink内部将水位线实现为特殊的记录，它们可以通过算子任务进行接收和发送。

source: Flink is a distributed data processing system, and as such, has to deal with failures such as killed processes, failing machines, and interrupted network connections.
zh_cn: Flink是一个分布式的数据处理系统，因此必须能够处理一些故障，例如：进程被强制关闭、机器故障以及网络连接中断。

source: Flink is a distributed system for stateful parallel data stream processing.
zh_cn: Flink是一个用于状态化并行流处理的分布式系统。

source: Flink is a full-fledged batch processor and can be used to implement use cases requir‐ ing one-off or periodic queries on bounded input data.
zh_cn: Flink其实还是一个成熟的批处理引擎，我们可以用它来实现对有界数据的一次性或定期查询。

source: Flink is able to run streaming applications 24/7 with very little downtime due to its highly-available setup (no single point of failure), a tight integration with Kubernetes, YARN, and Apache Mesos, fast recovery from failures, and the abil‐ ity to dynamically scale jobs.
zh_cn: Flink支持高可用性配置（无单点失效），和Kubernetes、YARN、Apache Mesos紧密集成，快速故障恢复，动态扩容作业等。基于上述特点，它可以7*24小时运行流式应用，几乎无须停机。

source: Flink is preconfigured to run a local setup and start a single master and a single Task‐ Manager on the local machine.
zh_cn: Flink中预定义的本地设置模式会在本地机器分别启动一个主进程和一个TaskManager，

source: Flink is well integrated with cluster resource managers, such as Apache Mesos, YARN, and Kubernetes, but can also be configured to run as a stand- alone cluster.
zh_cn: Flink和很多集群管理器（cluster resource manager）（如Apache Mesos、YARN及Kubernetes）都能很好地集成；同时它也可以通过配置，作为独立集群来运行。

source: Flink is well integrated with cluster resource managers, such as Apache Mesos, YARN, and Kubernetes, but can also be configured to run as a stand-alone cluster.
zh_cn: Flink和很多集群管理器，例如：Apache Mesos、YARN、Kubernetes，都有很好地集成；同时它也可以通过配置以独立集群模式运行。

source: Flink joined the Apache Software Foun‐ dation as an incubating project in April 2014 and became a top-level project in January 2015.
zh_cn: Flink于2014年4月以孵化项目的形式进入Apache软件基金会，并在次年1月就成为了顶级项目。

source: Flink knows about Hadoop’s configuration, it can connect to YARN’s ResourceMan‐
zh_cn: 一旦取得Hadoop的配置，Flink就可以连接YARN的ResourceManager和HDFS。

source: Flink maintains one state instance per key value and parti‐ tions all records with the same key to the operator task that maintains the state for this key.
zh_cn: Flink为每个键值都维护了一个状态实例，该实例总是位于那个处理对应键值记录的算子任务上。

source: Flink metrics are registered and accessed through the MetricGroup interface.
zh_cn: Flink指标需要通过MetricGroup接口注册和访问。

source: Flink metrics belong to a scope, which can be either the system scope, for system- provided metrics, or the user scope for custom, user-defined metrics.
zh_cn: Flink的指标都有各自所属的域（scope），系统指标所属的域被称为系统域，用户自定义指标所属的域被称为用户域。

source: Flink offers a few options to configure how state backends checkpoint their state.
zh_cn: Flink针对状态后端如何将状态写入检查点提供了很多配置项。

source: Flink offers different strategies to handle such late events, and we discuss those later in “Handling Late Data” on page 148.
zh_cn: Flink为处理此类迟到事件提供了不同的策略，我们稍后将在148页"处理迟到数据"中对它们进行介绍。

source: Flink offers good answers to all of these requirements.
zh_cn: Flink 能够完美满足上述需求。

source: Flink offers three primitives for operator state:
zh_cn: Flink为算子状态提供了三类原语：

source: Flink powers large-scale business-critical applications in many companies and enterprises across different industries and around the globe.
zh_cn: 全球各行各业很多公司和企业的大型核心业务应用都是基于Flink完成。

source: Flink powers large-scale, business-critical applications in many companies and enterprises across different industries and around the globe.
zh_cn: 全球很多不同行业的公司和企业都在使用Flink支撑其大规模核心业务。

source: Flink programs are executed lazily.
zh_cn: Flink程序都是通过延迟计算（lazily execute）的方式执行。

source: Flink provides Maven archetypes to generate Maven projects for Java or Scala Flink applications.
zh_cn: Flink提供了Maven模板来为Java或Scala的Flink应用生成Maven项目。

source: Flink provides a connector to Swift FS, which is based on Apache Hadoop.
zh_cn: Flink提供了一个基于Apache Hadoop的Swift FS连接器。

source: Flink provides a couple of parameters to tune checkpointing and state backends.
zh_cn: Flink提供了一系列用于调整检查点和状态后端的参数。

source: Flink provides a few configuration options in ./conf/flink-conf.yaml to specify a default filesystem and limit the number of filesystem connections.
zh_cn: Flink在./conf/flink-conf.yaml中提供了一些配置项，可用来指定默认的文件系统并限制文件系统连接数量。

source: Flink provides a few predefined settings to improve the performance for com‐ mon hardware setups.
zh_cn: 为了提高针对常见硬件的性能，Flink提供了一系列预定义设置。

source: Flink provides a mechanism to avoid such situations by marking source functions as temporarily idle.
zh_cn: 为了避免该情况，Flink提供了一个机制，可以将数据源函数标记为暂时空闲。

source: Flink provides a sink connector to write data streams to Cassandra.
zh_cn: Flink提供了一个用于将数据流写入Cassandra的数据汇连接器。

source: Flink provides a universal Kafka connector that works for all Kafka versions since 0.11.
zh_cn: Flink提供了一个通用的Kafka连接器，可用于Kafka 0.11之后的版本；

source: Flink provides a well-maintained collection of stream sinks that can be used to write data to different systems.
zh_cn: Flink提供了一组维护良好的流式数据汇，可用来完成上述工作。

source: Flink provides builds for the most commonly used vanilla Hadoop versions.
zh_cn: Flink为最常使用的Vanilla Hadoop版本都提供了相应的构建。

source: Flink provides built-in window assigners for the most common windowing use cases.
zh_cn: Flink为一些最常见的窗口使用场景提供了内置窗口分配器。

source: Flink provides connectors for Apache Kafka, Kinesis, RabbitMQ, Apache Nifi, vari‐ ous filesystems, Cassandra, ElasticSearch, and JDBC.
zh_cn: Flink为Apache Kafka、Kinesis、RabbitMQ、Apache Nifi、多种文件系统、Apache Cassandra、ElasticSearch以及JDBC都提供了相应的连接器。

source: Flink provides connectors to the most commonly used storage systems such as Apache Kafka, Apache Cassandra, Elasticsearch, JDBC, Kinesis, and (distributed) file systems such as HDFS and S3.
zh_cn: Flink提供了一些用于最常见存储系统的连接器，如Apache Kafka、Apache Cassandra、Elasticsearch、JDBC、Kinesis以及（分布式）文件系统（HDFS和S3等）。

source: Flink provides different mechanisms to deal with late records which are dis‐ cussed in Chapter 6.
zh_cn: 为了处理迟到记录，Flink提供了不同的机制，我们将在第6章讨论它们。

source: Flink provides different primitives for keyed state that determine the type of the value stored for each key in this distributed key-value map.
zh_cn: Flink为键值分区状态提供了不同原语，它们的区别在于分布式键值映射中每个键所对应存储值的类型不同。

source: Flink provides different sink implementations to write data streams of different data types to Cassandra.
zh_cn: Flink为写入Cassandra的不同类型的数据流提供了不同的数据汇实现。

source: Flink provides efficient implementations of Java tuples.
zh_cn: Flink提供了Java元组的高效实现，

source: Flink provides implementations for the most commonly used filesystems as follows:
zh_cn: Flink为一些常用的文件系统都提供了对应的实现，具体如下：

source: Flink provides intuitive and easy-to-use primitives for common event-time process‐ ing operations but also exposes expressive APIs to implement more advanced event-time applications with custom operators.
zh_cn: Flink不仅针对常见的事件时间操作提供了直观且易用的原语，还支持一些表达能力很强API，允许使用者以自定义算子的方式实现更高级的事件时间处理应用。

source: Flink provides intuitive and easy-to-use primitives for common event-time process‐ ing operations but also exposes expressive APIs to implement more advanced event- time applications with custom operators.
zh_cn: Flink不仅针对常见的事件时间操作提供了直观易用的原语，还支持一些表达能力很强API，允许使用者以自定义算子的方式实现更高级的事件时间处理应用。

source: Flink provides more tuning knobs to configure the checkpointing behavior, such as the choice of consistency guarantees (exactly-once or at-least-once), the number of concurrent checkpoints, and a timeout to cancel long-running checkpoints, as well as several state backend–specific options.
zh_cn: Flink还为检查点行为提供了其它一些可供调节的配置选项，例如：一致性保障（精确一次或至少一次）的选择，检查点的并行数量以及用来取消长时间运行检查点的超时时间，此外还有多个和状态后端相关的选项。

source: Flink provides multiple interfaces to define stateful functions.
zh_cn: Flink为定义状态化函数提供了多个接口。

source: Flink provides multiple primitives for keyed state.
zh_cn: Flink为键值分区状态提供了很多原语。

source: Flink provides sink connectors for all Kafka versions since 0.8.
zh_cn: Flink为Kafka 0.8之后的所有版本都提供了数据汇连接器。

source: Flink provides source connectors for all common Kafka versions.
zh_cn: Flink为所有常见的Kafka版本都提供了数据源连接器。

source: Flink provides state backends that manage keyed state as objects stored in in-memory data structures on the JVM heap.
zh_cn: Flink提供的一类状态后端会把键值分区状态作为对象，以内存数据结构的形式存在JVM堆里面；

source: Flink provides templates for the YAML files provided in the source distribution or found in the project’s Git repository.
zh_cn: Flink在源码发行版以及项目Git仓库中提供了YAML文件模板。

source: Flink provides the AssignerWithPunctuatedWatermarks interface for such cases, or when watermarks can be defined based on some other property of
zh_cn: Flink为此类情形以及可根据输入元素生成水位线的情形提供了AssignerWithPunctuatedWatermarks接口。

source: Flink provides the TwoPhaseCommitSinkFunction interface to ease the implementa‐ tion of sink functions that provide end-to-end exactly-once guarantees.
zh_cn: 我们可以利用Flink内置的TwoPhaseCommitSinkFunction接口来方便地实现提供端到端精确一次语义保障的数据汇函数。

source: Flink provides two alternative filesystem connectors to connect to S3, which are based on Apache Hadoop and Presto.
zh_cn: Flink分别基于Apache Hadoop和Presto实现了两个可选的S3文件系统连接器。

source: Flink provides two building blocks to implement transactional sink connectors—a generic write-ahead-log (WAL) sink and a two-phase-commit (2PC) sink.
zh_cn: Flink提供了两个构件来实现事务性的数据汇连接器——通用的WAL（write-ahead-log，写前日志）数据汇以及一个2PC（two-phase-commit，两阶段提交）数据汇。

source: Flink provides two utility classes for Java and Scala with static methods to generate a TypeInformation.
zh_cn: Flink为Java和Scala提供了两个工具类，其中的静态方法可以用来生成TypeInformation。

source: Flink provides unified syntax and semantics for batch and streaming queries.
zh_cn: Flink为批式和流式查询提供了统一的语法和语义。

source: Flink pro‐ vides configuration options to improve the efficiency by preregis‐ tering classes to Kryo.
zh_cn: 为了提高效率，Flink提供配置选项可以提前将类在Kryo中注册好。

source: Flink pro‐ vides parameters to address these situations.
zh_cn: Flink提供了一系列参数来处理此类情况。

source: Flink registers the classes of every job into a separate user-code classloader to ensure the dependencies of the job do not infer with Flink’s runtime dependencies or the dependencies of other jobs.
zh_cn: Flink会将每个作业的类注册到一个独立的用户代码类加载器中，这样可以保证作业依赖不会对Flink运行时或其他作业的依赖带来干扰。

source: Flink requires a sufficient number of network buffers to be able to ship records from one worker process to the other.
zh_cn: 为了顺利将记录在工作进程之间传输，Flink需要足够数量的网络缓冲区。

source: Flink restricts access to timestamps or watermarks through the DataStream API.
zh_cn: Flink对通过DataStream API访问时间戳和水位线有一定限制。

source: Flink restricts the access to timestamps or watermarks through the DataStream API.
zh_cn: Flink限制通过DataStream API访问时间戳和水位线。

source: Flink serializes all function objects with Java serialization to ship them to the worker processes.
zh_cn: Flink会利用Java序列化机制将所有函数对象序列化后发送到对应的工作进程。

source: Flink serves the REST API and the Web UI from the same web server, which runs as part of the Dispatcher process.
zh_cn: Flink使用一个Web服务器来同时支持REST API和Web UI，该服务器会作为Dispatcher进程的一部分来运行。

source: Flink supports Scala case classes.
zh_cn: Flink对Scala样例类也提供了相应支持。

source: Flink supports a feature called local recovery to significantly speed up recovery if the application can be restarted on the same machines.
zh_cn: Flink支持一种称为本地恢复的特性，能够在应用从相同机器重启时显著提高恢复速度。

source: Flink supports a wide variety of filesystems.
zh_cn: Flink支持的文件系统种类很多。

source: Flink supports all common data types that are available in Java and Scala.
zh_cn: Flink支持Java和Scala中所有常见数据类型，

source: Flink supports compressed checkpoints and savepoints.
zh_cn: Flink支持对检查点和保存点进行压缩，

source: Flink supports event-time and processing-time semantics.
zh_cn: Flink同时支持事件时间和处理时间语义。

source: Flink supports exactly-once state consistency guarantees.
zh_cn: Flink提供精确一次的状态一致性保障。

source: Flink supports four patterns for scaling different types of state.
zh_cn: Flink对不同类型的状态提供了四种扩缩容模式。

source: Flink supports many data types, which we describe in the next section.
zh_cn: Flink支持很多数据类型，我们会在下一节介绍它们。

source: Flink supports mutual authentication of communication partners and encryption of network communication with SSL for internal and external communication.
zh_cn: Flink支持通信伙伴之间的身份验证，还允许对内部或外部的网络通信进行SSL加密。

source: Flink supports several special-purpose types, such as primitive and object Array types; Java’s ArrayList, HashMap, and Enum types; and Hadoop Writable types.
zh_cn: Flink支持多种具有特殊用途的类型，例如：原始或对象类型的数组，Java的ArrayList、HashMap及Enum，Hadoop的Writable类型等。

source: Flink supports such updates by taking a savepoint of a running application, stopping it, and starting a new version of the application from the savepoint.5 However, updat‐ ing an application while preserving its state is only possible for certain application changes—the original application and its new version need to be savepoint compati‐ ble.
zh_cn: Flink可以通过为运行的应用生成保存点，停止该应用，重启新版本等三个步骤来实现此类更新。5 然而这种保留状态的应用更新对应用改动也有一些限制——原始应用和新版本应用的检查点必须兼容。

source: Flink supports two authentication modes—keytabs and Hadoop delegation tokens.
zh_cn: Flink支持两种身份验证模式——keytabs和Hadoop委托令牌（delegation token）。

source: Flink treats all states—regardless of built-in or user-defined operators—the same.
zh_cn: 无论是内置状态还是用户自定义状态，Flink对它们都一直同仁。

source: Flink uses ZooKeeper for leader election and as a highly available and durable datastore.
zh_cn: 它在Flink中主要用于"领导"选举以及持久且高可用的数据存储。

source: Flink uses ZooKeeper for leader election and as a highly-available and durable data store.
zh_cn: 它在Flink中用于"领导"选举以及高可用性数据持久化存储。

source: Flink will do all the hard work so you can easily monitor, operate, and reconfigure your jobs with minimal effort while preserving exactly-once state semantics.
zh_cn: Flink将替你完成全部棘手的工作，你可以在轻松地监控、操纵并重新配置作业的同时享受精确一次状态语义。

source: Flink will exclude stream partitions produced by idle source functions from the watermark computation of subsequent operators.
zh_cn: Flink会在后续算子计算水位线的时候把那些来自于空闲源函数的流分区排除在外。

source: Flink will never evaluate empty windows.
zh_cn: Flink永远不会对空窗口执行计算。

source: FlinkCEP for Complex Event Processing and Pattern Matching
zh_cn: 用于复杂事件处理和模式匹配的FlinkCEP

source: FlinkCEP is a high-level API and library for complex event pattern detection.
zh_cn: FlinkCEP是一个用于复杂事件模式检测的高层次的API库。

source: FlinkKafkaPartitioner can be defined in some con‐ structors of the Flink Kafka sink.
zh_cn: 它的某些构造函数允许你定义FlinkKafkaPartitioner。

source: FlinkKafkaProducer provides more constructors with different combinations of arguments as follows:
zh_cn: FlinkKafkaProducer还提供了很多具有不同参数组合的构造方法：

source: Flink’s CLI client at ./bin/flink, manage running applications, or request information about the cluster or running applications.
zh_cn: Flink的CLI（命令行界面）客户端位于./bin/flink，它可以用来管理当前正在运行的应用，也可以通过请求获取有关集群或当前运行应用的信息。

source: Flink’s CLI client supports many more parameters, such as the ability to control the memory of TaskManager containers.
zh_cn: Flink的CLI客户端还支持很多参数，例如用于控制TaskManager容器内存大小的参数等。

source: Flink’s Checkpointing Algorithm
zh_cn: Flink检查点算法

source: Flink’s DataStream API features two built-in operators to join streams with a temporal condition: the interval join and the window join.
zh_cn: Flink DataStream API中内置有两个可以根据时间条件对数据流进行Join的算子：基于间隔的Join和基于窗口的Join。

source: Flink’s DataStream API is available for Java and Scala.
zh_cn: Flink DataStream API支持Java和Scala语言，

source: Flink’s Data‐ Stream API offers the ProcessWindowFunction to perform arbitrary computations on the contents of a window.
zh_cn: Flink DataStream API提供的ProcessWindowFunction可以对窗口内容执行任意计算。
